// структуры и внешние ф-ии для работы с адаптером ОЛ
// #Astra_CLS.H
//	Author T.Gorokhova

#include <windows.h>

#if defined(WIN32)
# define EXPORT_CL __stdcall
#else
# define EXPORT_CL _export far pascal
#endif

//=========================================================================
// ФУНКЦИИ ВНЕШНЕГО ВЫЗОВА
//=================================================================
//=================================================================
//=================================================================
// NumPC - код номера РС 
// NumDevice      :3;	// Порядковый номер адаптера данного типа в данном РС(биты 24-26)
// TypeDevice     :6;	// Тип адаптера (биты 27-32)
// NumPC          :4;		// Номер компьютера (биты 29,30,31,32)
// BurstSize = DataBurst.BurstSize -количество имитируемых адресов
// (может быть больше реально заданного, нужно только для резервирования памяти массивов адресов и данных)
// структура AstraPCI_BURST_INFO[] 
// для каждого регистрируемого адреса:
//	Choice;	// StrDescr.Choice  StrDescr.Choice  признак регистраци (у нас всегда 1, в автономной задаче возможно снятие регистрации)
//	Intr;	// StrDescr.SubAddress - признак формирования импульса по приходу адреса, 1 - да, 0- нет
//  MPIAddress  =StrDescr.Address -Адрес МПИ. Если Адрес =0, он не имитируется 

// Возвращает 
// __SUCCESS:				количество заданных линий,включая линии с нулевыми адресами.
// ERROR_MEM_LOCATION		-1  ошибка создания объекта
// INVALID_BASE_ADDRESS		-2
// ERROR_ADAPTER_NOT_FOUND	-3
// ERROR_DATA_NOT_EQUAL		-4
long __stdcall vbCreate_AstraPCI(ULONG NumDevice,
					  ULONG BurstSize,
					  AstraPCI_BURST_INFO inf[]);								

//=========================================================================
// Прием данных по МПИ
// Возвращает 0;
//=================================================================
long  __stdcall vbRecv_AstraPCI(void);
//=================================================================
//	Передает значение параметра для вывода
// InOut	-	признак входной/выходной линии 1/0 
// NumWord  =	StrDescr.NumWord - Номер канала адаптера 
// NumDevice	Порядковый номер адаптера данного типа в данном РС
// TypeDevice	Тип адаптера 
// NumRack		Номер стойки -не проверяется
// NumPC  		Номер компьютера 
// Данные Data.
//  возвращаемые значения
//	0-OK
//	-1 - несоответствие: NumLine > допустимого числа адресов  SIZE_INP
//  -2 - этот канал при инициализации задан на чтение
//=================================================================
 long  __stdcall vbRead_AstraPCI(ID_Parameter &Param );
//=========================================================================
 long  __stdcall vbClose_AstraPCI();
//------------------------------ Сервисные функции-------------------------
// Возвращает номер версии
//=========================================================================
long __stdcall vbGetVersionAstraPCI(void);
