// структуры и внешние ф-ии для работы с адаптером ОЛ
// #Astra_CLS.H
//	Author T.Gorokhova

#include <windows.h>

#if defined(WIN32)
# define EXPORT_CL __stdcall
#else
# define EXPORT_CL _export far pascal
#endif

//=========================================================================
// ФУНКЦИИ ВНЕШНЕГО ВЫЗОВА
//=================================================================
//=================================================================
//=================================================================
// NumDevice    ;	// Порядковый номер адаптера данного типа в данном РС), начиная с 0. 
					//В БД - номер с 1, из IPC передается с 0 !!!!!

// Возвращает 
// __SUCCESS:				количество заданных линий,включая линии с нулевыми адресами.
// ERROR_MEM_LOCATION		-1  ошибка создания объекта
// INVALID_BASE_ADDRESS		-2
// ERROR_ADAPTER_NOT_FOUND	-3
// ERROR_DATA_NOT_EQUAL		-4
long __stdcall vbCreate_AstraPCI_BL(ULONG NumDevice);								

//=========================================================================
// Прием данных по МПИ
// Возвращает 0;
//=================================================================
long  __stdcall vbRecv_AstraPCI_BL(void);
//=================================================================
//	Чтение параметров 
// Вход:
// Address		:18  =StrDescr.Address - 18-разр. адрес МПИ 
// NumWord	:3;	// 0, 1..4 StrDescr.NumWord (биты 21-23)-номер считываемой записи для отладки, 
				// 0 - штатное считывание 
// Выход:
// Data		  =	значение счётчика слова - старшие 16 бит,
//				угол - младшие 14 бит
// Возвращаемые значения
// Возвращает :
//  0 - ОК
// -2 - ошибка задания адреса
// -1 - сбойная информация
//=================================================================
 long  __stdcall vbRead_AstraPCI_BL(ID_Parameter &Param );
//=========================================================================
 long  __stdcall vbClose_AstraPCI_BL();
//------------------------------ Сервисные функции-------------------------
// Возвращает номер версии
//=========================================================================
long __stdcall vbGetVersionAstraPCI_BL(void);
