//-----------------------------------------------------------------------------
//			Внешние функции для DISP_IO
//-----------------------------------------------------------------------------
long __stdcall PCADC_WriteNameShM (DWORD,LPSTR);	//Пропись имен в ShMem

//-----------------------------------------------------------------------------
//			Внешние функции для PCADS
//-----------------------------------------------------------------------------
short __stdcall Create_PCADC04 ( short );			// Открыть память для записи