#ifndef __PCI1724_DLL_H__
#define __PCI1724_DLL_H__
//   #pci1724.h
//   Автор Т. Горохова

//==========================================================================
//	EXTERNAL FUNCTION
//==========================================================================
//=================================================================
// Если задан номер адаптера d[].NumDev, ищет плату с заданным номер,
// если d[].NumDev=0, ищет плату 1724. 
// Вход -
//		NumDevs - количество плат (от 1 до 8) типа 1724
//      cnf[].NumPC - Номер РС, 
//		cnf[].Sync - признак режим(1 -синхронный вывод в каналах)
//		cnf[].NumDev - номер устройства данного типа на компьютере, начиная с 1
//		cnf[].NumDev = 0 означает - открыть любое устройство данного типа
// Выход - найденные ресурсы d[], номер устройства, заданный на найденной плате
// Возвращает количество окрытых устройств

// __SUCCESS:				 >0 адаптер обнаружен
// ERROR_DEVICE_NUMBER       0 Задан ошибочный номер адаптера
//ошибки создания объекта
//ERROR_MEMORY_LOCATION -1
//ERROR_ADAPTER_NOT_FOUND -2
//ERROR_DEVICE_NUMBER      -3
//ERROR_DATA_NOT_READY -4
//ERROR_FIFO_DEFINITION -5



long __stdcall	vbCreate_PCI1724(short NumDevs, DeviceRes_PCI1724 d[]);

long __stdcall vbClose_PCI1724();
//==========================================================================
// 0= OK
// -4	ERROR_ADAPTER_NOT_FOUND = устройство не открыто, или устройство друго типа, или другой кмпьютер
// -5	ERROR_DATA_NOT_READY = данные не считаны
//==========================================================================
long __stdcall vbWrite_PCI1724( ID_Parameter Param );
//==========================================================================
// 0= OK
// -4	ERROR_ADAPTER_NOT_FOUND = устройство не открыто, или устройство друго типа, или другой кмпьютер
// -5	ERROR_DATA_NOT_READY = данные не считаны
//==========================================================================
long __stdcall vbSend_PCI1724();

long  __stdcall vbCreateTimer_PCI1724 (ULONG msPeriod);


#endif //__PCI1724_DLL_H__