//   #pci1716_cl.h
//   Автор Т. Горохова

//==========================================================================
//	EXTERNAL FUNCTION
//==========================================================================
// Создает объект класса, проверяет заись-чтение в базовый регистр,
// прописывает адреса в ОЗУ адаптера, запускает адаптер
// NumPC - код номера РС 
// d.BasePort=Adapters.PortIO	- адрес базового порта
// d.nIRQ	= Adapters.InterruptNum - not used
// d.PortSize=Adapters.PortSize 
// NumCh -количество используемых каналов
// NumDev - номер устройства данного типа на компьютере, начиная с 1 до 8
// Conf[32] - настройки каналов АЦП

// Возвращает количество окрытых устройств

// __SUCCESS:				 1 адаптер обнаружен
// ERROR_MEM_LOCATION		-1  ошибка создания объекта
// INVALID_BASE_ADDRESS		-2
// ERROR_ADAPTER_NOT_FOUND	-3
// ERROR_DEVICE_NUMBER       0 Задан ошибочный номер адаптера

//Gain - код определяется размахом сигнала и рассчитывается исходя из амплитуды (поле NumWord(Amplitude) и SignBit1 (би/униполярности сигнала)).
//cnf[].Gain может принимать следующие значения:  0(+-10 в),1(10в),2(5в),4(2.5в) 8(1.25в).
//Amplitude (поле StrDescr.NumWord) - модуль сигнала, допустимые значения 10, 5, 2.5, 1.25, 0.625
					// Gain =10/(Amplitude*(1+SignBit1)) 
					// Пример: Amplitude = 5, SignBit1=1  для +-5 Gain =1
					// Пример: Amplitude = 5, SignBit1=0 для 0...5 Gain =2
					// Пример: Amplitude = 10, SignBit1=1 для +-10  Gain =0.5 =0 



long _stdcall	vbCreate_PCI1716(short NumDev, DevicePCI1716 d[], PCI1716_CONFIG cnf[])	;
long _stdcall	vbCreateAndDef_PCI1716(short NumDev, DevicePCI1716 d[], PCI1716_CONFIG cnf[]);
long _stdcall vbClose_PCI1716();
//==========================================================================
// 0= OK
// -4	ERROR_ADAPTER_NOT_FOUND = устройство не открыто, или устройство друго типа, или другой кмпьютер
// -5	ERROR_DATA_NOT_READY = данные не считаны
//==========================================================================
long _stdcall vbRead_PCI1716( ID_Parameter &Param );
//==========================================================================
// 0= OK
// -4	ERROR_ADAPTER_NOT_FOUND = устройство не открыто, или устройство друго типа, или другой кмпьютер
// -5	ERROR_DATA_NOT_READY = данные не считаны
//==========================================================================
long _stdcall vbReadRaw_PCI1716( ID_Parameter &Param );
//==========================================================================
// 0= OK
// -4	ERROR_ADAPTER_NOT_FOUND = устройство не открыто, или устройство друго типа, или другой кмпьютер
// -5	ERROR_DATA_NOT_READY = данные не считаны
//==========================================================================
long _stdcall vbRecv_PCI1716();

